ideologies1 = [
    {
        "name": "自由左",
        "stats": {
            "econ": 92.5,
            "govt": 82.5,
            "scty": 85
        }
    },
    {
        "name": "列左",
        "stats": {
            "econ": 107.5,
            "govt": 45,
            "scty": 60
        }
    },
    {
        "name": "左翼粉红",
        "stats": {
            "econ": 65,
            "govt": 20,
            "scty": 37.5
        }
    },
    {
        "name": "自由派",
        "stats": {
            "econ": 47.5,
            "govt": 70,
            "scty": 67.5
        }
    },
    {
        "name": "黄黑",
        "stats": {
            "econ": 17.5,
            "govt": 75,
            "scty": 65
        }
    },
    {
        "name": "岁静",
        "stats": {
            "econ": 50,
            "govt": 42.5,
            "scty": 50
        }
    },
    {
        "name": "右翼粉红",
        "stats": {
            "econ": 35,
            "govt": 7.5,
            "scty": 15
        }
    }
];
Ideos=[
    {
        "name": "无政府共产主义",
        "fath":0,
        "stats": {
            "econ": 100,
            "dipl": 65,
            "govt": 100,
            "scty": 100,
            "revo": 75
        },
        "desc":"无政府共产主义（Anarcho-Communism）是无政府主义中最主要的流派，主张废除国家机器和私有制，在自愿和互助的基础上建立一个各尽所能，按需分配的公有制社会。"
    },
    {
        "name": "左派共产主义",
        "stats": {
            "econ": 100,
            "dipl": 80,
            "govt": 80,
            "scty": 100,
            "revo": 60
        },
        "desc":"左派共产主义（Left Communism）是一种反对威权主义和议会斗争的共产主义流派，尽管其中有着对组织形式（群众党或工人委员会）的分歧，但共同的特点是更加工人阶级的立场，即对工人阶级外的改良派和中间分子的激烈反对；以及反对民族自决的国际主义。"
    },
    {
        "name": "卢森堡主义",
        "stats": {
            "econ": 100,
            "dipl": 55,
            "govt": 60,
            "scty": 90,
            "revo": 90
        },
        "desc":"卢森堡主义（Luxemburgism）者往往反对第二国际式的议会斗争，是激进的暴力革命的支持者，认为必要时可以采取先锋队式的组织形式；但他们认为这一形式只能作为过渡手段，过度的专政会导致社会主义政权变成资产阶级专政。"
    },
    {
        "name": "列宁主义",
        "stats": {
            "econ": 100,
            "dipl": 45,
            "govt": 40,
            "scty": 70,
            "revo": 100
        },
        "desc": "列宁主义（Leninism）发展了马克思主义，提出了帝国主义理论和先锋队理论，主张通过民主集中制原则组织的先锋队领导工人阶级通过暴力革命夺取政权。"
    },
    {
        "name": "毛主义",
        "stats": {
            "econ": 100,
            "dipl": 35,
            "govt": 30,
            "scty": 70,
            "revo": 100
        },
        "desc":"毛主义（Maoism）是中国革命的历史总结，在继承了列宁主义的基础上，发展了农村包围城市的革命手段，同时提出了无产阶级专政下的继续革命理论，期望用自下而上的运动来防止本国先锋队的变质。"
    },
    {
        "name": "马克思列宁主义",
        "stats": {
            "econ": 100,
            "dipl": 25,
            "govt": 0,
            "scty": 50,
            "revo": 80
        },
        "desc":"马克思列宁主义（Marxism Leninism）是斯大林对马克思和列宁理论的总结，主张社会主义可以在一国内建成，认为应当实施高度集中的计划经济，同时进行自上而下的清洗"
    },
    {
        "name": "托洛茨基主义",
        "stats": {
            "econ": 90,
            "dipl": 80,
            "govt": 50,
            "scty": 90,
            "revo": 100
        },
        "desc":"托洛茨基主义（Trotskyism）主张世界范围内的不断革命，认为任何在一国内部胜利的社会主义都是暂时的，同时反对官僚主义的等級制度。"
    },
    {
        "name": "无政府工团主义",
        "stats": {
            "econ": 80,
            "dipl": 65,
            "govt": 100,
            "scty": 100,
            "revo": 90
        },
        "desc":"无政府工团主义（Anarcho-syndicalism），亦称革命工团主义，是20世纪初流行于欧洲的国际工人运动中的无政府主义思潮。该思潮认为工人必须在革命工会的团结和领导下废除国家机器，并旨在建立工人自治的经济团体和自我管理的工人组织。"
    },
    {
        "name": "自由意志社会主义",
        "stats": {
            "econ": 80,
            "dipl": 65,
            "govt": 80,
            "scty": 80,
            "revo": 50
        },
        "desc":"自由意志社会主义（Libertarian Socialism）是一种反权威的社会主义学说，它主张通过去中心化的政治组织实现社会主义，反对各种强制性制度，例如计划经济和国家机器的使用。"
    },
    {
        "name": "民主社会主义",
        "stats": {
            "econ": 80,
            "dipl": 55,
            "govt": 65,
            "scty": 70,
            "revo": 30
        },
        "desc":"民主社会主义（Democratic Socialism）是一种把现代民主宪政和社会主义经济合为一体的政治意识形态。他们反对列宁主义的集中制，支持在自由民主制下进行议会斗争，并且最终达到废除生产资料私有制的目标。"
    },
    {
        "name": "新左派",
        "stats": {
            "econ": 80,
            "dipl": 40,
            "govt": 50,
            "scty": 90,
            "revo": 75
        },
        "desc":"新左派（New Left）意识形态产生于20世纪60年代，在后社会主义世界经济政治环境与国际全球化大潮仍然具有影响力。他们最突出的特点是行动主义式的反建制，而不是某种具体的革命理论。"
    },
    {
        "name": "左翼民族主义",
        "stats": {
            "econ": 75,
            "govt": 15,
            "dipl": 20,
            "scty": 40,
            "revo": 30
        },
        "desc":"左翼民族主义是一种反对族裔特权和帝国主义军事政治干预，主张社会公平的民族主义，他们拥有强烈的国族认同，但往往不认为国家和民族有优劣。"
    },
    {
        "name": "社会民主主义",
        "stats": {
            "econ": 65,
            "dipl": 75,
            "govt": 60,
            "scty": 60,
            "revo": 15
        },
        "desc":"（现代）社会民主主义是一种左派思想，支持通过在自由民主体制和资本主义经济体系下，通过经济干预和社会干预的手段促进社会正义的意识形态。与社会主义不同，社会民主主义并不以废除私有制为最终目标。"
    },
    {
        "name": "左翼民粹主义",
        "stats": {
            "econ": 70,
            "dipl": 35,
            "govt": 25,
            "scty": 50,
            "revo": 60
        }
        ,"desc":"左翼民粹主义者支持采取强大的国家干预来缩小贫富差距，同时有一个高声望的领袖带领人们反对新自由主义精英。"
    },
    {
        "name": "民族布尔什维克",
        "stats": {
            "econ": 70,
            "dipl": 0,
            "govt": 0,
            "scty": 50,
            "revo": 75
        }
        ,"desc":"民族布尔什维克结合了部分经典左翼立场和极端民族主义观点，他们反对无产阶级国际主义，主张本民族的利益高于一切，同时团结极左和极右的激进分子。"
    },
    {
        "name": "专家政治",
        "stats": {
            "econ": 55,
            "dipl": 50,
            "govt": 20,
            "scty": 80,
            "revo": 25
        }
        ,"desc":"专家政治是这样一种政治经济理念，它主张根据在给定责任领域（尤其是在科学或技术知识方面）的专业知识来选拔决策者。"
    },
    {
        "name": "正义主义(庇隆主义)",
        "stats": {
            "econ": 50,
            "dipl": 25,
            "govt": 25,
            "scty": 50,
            "revo": 50
        }
        ,"desc":"庇隆主义，又称正义主义，它是典型的第三位置理念，以国家复兴、民族解放和社会正义为主要内容。它吸收了意大利法西斯的社团主义和中央集权，但并无种族偏见内容，同时重视劳工和女性权益。"
    },
    {
        "name": "国家资本主义",
        "stats": {
            "econ": 40,
            "dipl": 60,
            "govt": 20,
            "scty": 70,
            "revo": 20
        }
        ,"desc":"作为一种政体的国家资本主义，是与国家政权相结合,由国家掌握和控制的一种私人资本主义。与威权资本主义不同的是，国家往往会高度介入市场，而并非采取自由放任的经济政策。"
    },
    {
        "name": "左翼自由意志主义",
        "stats": {
            "econ": 55,
            "dipl": 70,
            "govt": 80,
            "scty": 80,
            "revo": 50
        }
        ,"desc":"左翼自由意志主义主张在充分尊重个人财产和自由意志的前提下，反对资本主义与私有制的生产手段，尤其反对私人占有自然资源。"
    },
    {
        "name": "社会自由主义",
        "stats": {
            "econ": 50,
            "dipl": 70,
            "govt": 60,
            "scty": 60,
            "revo": 0
        }
        ,"desc":"社会自由主义是一种偏向社会公平和经济干预的自由主义，在经济上主张政府干预市场经济，主张发展福利和社会规划。在政治上主张扩大公民权利和政治权利，以达到共同利益与个人自由的和谐。"
    },
    {
        "name": "新自由主义",
        "stats": {
            "econ": 25,
            "dipl": 80,
            "govt": 60,
            "scty": 60,
            "revo": 65
        }
        ,"desc":"新自由主义是20世纪70年代以来逐渐复苏的国际经济政策形式。在国内它强调自由市场并且追求效率，反对国家干预和最低工资等政策，在全球它支持采用经济、政治乃至军事手段扩张国际市场"
    },
    {
        "name": "互助主义",
        "stats": {
            "econ": 60,
            "dipl": 80,
            "govt": 100,
            "scty": 60,
            "revo": 40
        }
        ,"desc":"互助主义是一种无政府主义主张，它认为每个人都应拥有生产资料（不论以个人或集体的形式），并且在劳动价值的基础上进行商品交换"
    },
    {
        "name": "自由意志主义",
        "stats": {
            "econ": 20,
            "dipl": 80,
            "govt": 80,
            "scty": 65,
            "revo": 50
        }
        ,"desc":""
    },
    {
        "name": "古典自由主义",
        "stats": {
            "econ": 10,
            "dipl": 100,
            "govt": 65,
            "scty": 65,
            "revo": 25
        }
        ,"desc":""
    }, 
    {
        "name": "小政府主义",
        "stats": {
            "econ": 0,
            "dipl": 75,
            "govt": 75,
            "scty": 60,
            "revo": 15
        }
        ,"desc":""
    }, 
    {
        "name": "无政府资本主义",
        "stats": {
            "econ": 0,
            "dipl": 75,
            "govt": 100,
            "scty": 50,
            "revo": 30
        }
        ,"desc":""
    }, 
    {
        "name": "市场无政府主义/个人主义",
        "stats": {
            "econ": 30,
            "dipl": 80,
            "govt": 100,
            "scty": 40,
            "revo": 20
        }
        ,"desc":""
    }, 
    {
        "name": "威权资本主义",
        "stats": {
            "econ": 0,
            "dipl": 70,
            "govt": 0,
            "scty": 50,
            "revo": 65
        }
        ,"desc":"威权资本主义是支持使用强力手段保障一个自由放任市场的意识形态，往往采取一党制措施并高度限制政治自由，必要的时候可以采取武力措施维持统治。"
    }, 
    {
        "name": "法西斯主义",
        "stats": {
            "econ":30,
            "dipl": 0,
            "govt": 0,
            "scty": 45,
            "revo": 90
        }
        ,"desc":"法西斯主义强调政府中央集权至上，其特点是独裁的公权力，强大的社会和经济统一执行力，激进的民族主义和国家主义，以及强制镇压反对意见。 法西斯主义在20世纪初的欧洲政治中有着显著的地位。"
    },
    {
        "name": "纳粹主义",
        "stats": {
            "econ":50,
            "dipl": 0,
            "govt": 0,
            "scty": 30,
            "revo": 90
        }
        ,"desc":""
    },
    {
        "name": "基督教民主主义",
        "stats": {
            "econ":40,
            "dipl": 60,
            "govt": 50,
            "scty": 30,
            "revo": 20
        }
        ,"desc":""
    },
    {
        "name": "进步保守主义",
        "stats": {
            "econ":50,
            "dipl": 40,
            "govt": 45,
            "scty": 55,
            "revo": 0
        }
        ,"desc":"进步保守主义结合了保守主义和进步主义的主张，支持有限度的社会安全网和财富再分配，主张政府对市场中生产消费行为的调控，以及渐进的社会变革。"
    },
    {
        "name": "君主专制",
        "stats": {
            "econ":40,
            "dipl": 30,
            "govt": 10,
            "scty": 0,
            "revo": 25
        }
        ,"desc":""
    },
    {
        "name": "保守主义",
        "stats": {
            "econ":30,
            "dipl": 45,
            "govt": 30,
            "scty": 25,
            "revo": 0
        }
        ,"desc":""
    },
    {
        "name": "右翼民粹主义",
        "stats": {
            "econ":30,
            "dipl": 20,
            "govt": 40,
            "scty": 40,
            "revo": 50
        }
        ,"desc":""
    },
    {
        "name": "保守社会主义",
        "stats": {
            "econ":85,
            "dipl": 25,
            "govt": 15,
            "scty": 10,
            "revo": 60
        }
        ,"desc":""
    },
    {
        "name": "新保守主义",
        "stats": {
            "econ":10,
            "dipl": 35,
            "govt": 35,
            "scty": 10,
            "revo": 10
        }
        ,"desc":""
    }
];

